BrentBaccala/CoCoA/src/AlgebraicCore/TmpMorseGraph.C
//   Copyright (c)  2013  Mario Albert

//   This file is part of the source of CoCoALib, the CoCoA Library.

//   CoCoALib is free software: you can redistribute it and/or modify
//   it under the terms of the GNU General Public License as published by
//   the Free Software Foundation, either version 3 of the License, or
//   (at your option) any later version.

//   CoCoALib is distributed in the hope that it will be useful,
//   but WITHOUT ANY WARRANTY; without even the implied warranty of
//   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//   GNU General Public License for more details.

//   You should have received a copy of the GNU General Public License
//   along with CoCoALib.  If not, see <http://www.gnu.org/licenses/>.


#include "CoCoA/TmpMorseGraph.H"

#include "CoCoA/DenseMatrix.H"
#include "CoCoA/MatrixOperations.H"
#include "CoCoA/MatrixView.H"
#include "CoCoA/TmpResolutionMinimization.H"

using std::make_pair;

namespace CoCoA
{

  std::vector<MorseElement> MorseGraph::myComputeGeneralBasis() const
  {
    std::vector<MorseElement> basis;
    for (PommBasisElem it = myBasis.begin(); it != myBasis.end(); ++it)
    {
      const std::vector<long> NonMultVars(myDynamicBitsetToLong(flip(it->second)));
      const std::vector<DynamicBitset> bitsets(myPossibleWedges(NonMultVars, NumIndets(myRing)));
      for (std::vector<DynamicBitset>::const_iterator BitsetIter = bitsets.begin(); BitsetIter != bitsets.end(); ++BitsetIter)
      {
        basis.push_back(MorseElement(*BitsetIter, it));
      }
    }
    return basis;
  }


  std::vector<DynamicBitset> MorseGraph::myPossibleWedges(const std::vector<long>& NonMultVars, long length) const
  {
    std::vector<std::vector<long> > ResultAsVector;
    const long NumNonMultVars = len(NonMultVars);
    for (long i = 0; i <= NumNonMultVars; ++i)
    {
      myVariationWithoutRepetition(ResultAsVector, std::vector<long>(), NonMultVars, i);
    }
    std::vector<DynamicBitset> result; result.reserve(len(ResultAsVector));
    for (std::vector<std::vector<long> >::iterator it = ResultAsVector.begin(); it != ResultAsVector.end(); ++it)
    {
      result.push_back(myVectorLongToDynamicBitset(*it, length));
    }
    return result;
  }


  void MorseGraph::myVariationWithoutRepetition(std::vector<std::vector<long> >& result,
                                                const std::vector<long>& CurrentResult,
                                                const std::vector<long>& InputSet,
                                                long length)  const
  {
    if (length == 0)
    {
      result.push_back(CurrentResult);
      return;
    }
    for (std::vector<long>::const_iterator it = InputSet.begin(); it != InputSet.end(); ++it)
    {
      std::vector<long> TmpCurrentResult(CurrentResult);
      TmpCurrentResult.push_back(*it);
      std::vector<long>::const_iterator iter(it);
      ++iter;
      std::vector<long> TmpInputSet(iter, InputSet.end());
      myVariationWithoutRepetition(result, TmpCurrentResult, TmpInputSet, length - 1);
    }
  }


  void MorseGraph::myComputeBasicGraph(const std::vector<MorseElement>& elems, StandardRepresentationContainer& container)
  {
    for (std::vector<MorseElement>::const_iterator it = elems.begin(); it != elems.end(); ++it)
    {
      ConstResIter IterToRes(myResolution.insert(make_pair(*it, MorsePaths())).first);
      std::vector<std::pair<MorseElement, RingElem> > maps(it->myComputeBasicMaps(myGetBasisRange(), container));
      myAddMapsToResolution(maps, IterToRes);
    }
  }


  void MorseGraph::myComputeBasicConstantGraph(const std::vector<MorseElement>& elems, StandardRepresentationContainer& container)
  {
    for (std::vector<MorseElement>::const_iterator it = elems.begin(); it != elems.end(); ++it)
    {
      ConstResIter IterToRes(myResolution.insert(make_pair(*it, MorsePaths())).first);
      std::vector<std::pair<MorseElement, RingElem> > maps(it->myComputeBasicConstantMaps(myGetBasisRange(), container));
      myAddMapsToResolution(maps, IterToRes);
    }
  }


  void MorseGraph::myAddMapsToResolution(const std::vector<std::pair<MorseElement, RingElem> >& maps, const ConstResIter& origin)
  {
    for (std::vector<std::pair<MorseElement, RingElem> >::const_iterator MapIter = maps.begin(); MapIter != maps.end(); ++MapIter)
    {
      myResolution[MapIter->first].myAddPath(origin, MapIter->second);
    }
  }



  void MorseGraph::myDirectMorseReduction(StandardRepresentationContainer& container)
  {
    std::map<MorseElement, MorsePaths>::iterator ResolutionIter(myResolution.end());
    --ResolutionIter;
    while (ResolutionIter != myResolution.begin())
    {
      if ((ResolutionIter->first).IAmBasisElement())
      {
        --ResolutionIter;
        continue;
      }
      MorseElement morse(ResolutionIter->first);
      //assert !(ResolutionIter->second).IAmEmpty() 
      const long maximum(morse.myMaxTypeOne());
      if ((maximum == -1) || (maximum != morse.myMaxTypeTwo()) || (ResolutionIter->second).IamEmpty())
      {
        ResolutionIter = myDeleteAndJumpToPrevious(ResolutionIter);
        continue;
      }
      const PathMap& paths((ResolutionIter->second).myGetPaths());
      std::vector<long> longs(morse.myGetWedgeProductAsLongs());
      // because of myMaxTypeOne i is not in longs
      longs.push_back(maximum);
      for (std::vector<long>::iterator LongIter = longs.begin(); LongIter != longs.end(); ++LongIter)
      {
        DynamicBitset NewWedgeProduct(morse.myGetWedgeProduct());
        NewWedgeProduct.mySet(maximum, true);
        NewWedgeProduct.mySet(*LongIter, false);
        myLeftMinimization(paths, NewWedgeProduct, morse, maximum, *LongIter);
        myRightMinimization(paths, NewWedgeProduct, morse, maximum, *LongIter, container);
      }
      ResolutionIter = myDeleteAndJumpToPrevious(ResolutionIter);
    }
  }


  void MorseGraph::myConstantDirectMorseReduction(StandardRepresentationContainer& container)
  {
    std::map<MorseElement, MorsePaths>::iterator ResolutionIter(myResolution.end());
    --ResolutionIter;
    while (ResolutionIter != myResolution.begin())
    {
      if ((ResolutionIter->first).IAmBasisElement())
      {
        --ResolutionIter;
        continue;
      }
      MorseElement morse(ResolutionIter->first);
      //assert !(ResolutionIter->second).IAmEmpty() 
      const long maximum(morse.myMaxTypeOne());
      if ((maximum == -1) || (maximum != morse.myMaxTypeTwo()) || (ResolutionIter->second).IamEmpty())
      {
        ResolutionIter = myDeleteAndJumpToPrevious(ResolutionIter);
        continue;
      }
      const PathMap& paths((ResolutionIter->second).myGetPaths());
      std::vector<long> longs(morse.myGetWedgeProductAsLongs());
      // because of myMaxTypeOne i is not in longs
      longs.push_back(maximum);
      for (std::vector<long>::iterator LongIter = longs.begin(); LongIter != longs.end(); ++LongIter)
      {
        DynamicBitset NewWedgeProduct(morse.myGetWedgeProduct());
        NewWedgeProduct.mySet(maximum, true);
        NewWedgeProduct.mySet(*LongIter, false);
        myRightMinimization(paths, NewWedgeProduct, morse, maximum, *LongIter, container);
      }
      ResolutionIter = myDeleteAndJumpToPrevious(ResolutionIter);
    }
  }


  std::map<MorseElement, MorsePaths>::iterator MorseGraph::myDeleteAndJumpToPrevious(std::map<MorseElement, MorsePaths>::iterator iter)
  {
    std::map<MorseElement, MorsePaths>::iterator TmpIter(iter);
    --iter;
    myResolution.erase(TmpIter);
    return iter;
  }

