BrentBaccala/CoCoA/src/AlgebraicCore/TmpMorseGraph.C
  RingElem MorseGraph::myCreateNewBasisElement(const MorseElement& m, long IndexMult, long IndexDiv) const
  {
    RingElem result(indet(myRing, IndexMult));
    result *= monomial(myRing, one(CoeffRing(myRing)), m.myGetRightFactor());
    result = result / indet(myRing, IndexDiv);
    result *= m.myGetBasisElement();
    return result;
  }

  void MorseGraph::myLeftMinimization(const PathMap& paths, DynamicBitset NewWedgeProduct, const MorseElement& origin, long maximum, long LongIter)
  {
    MorseElement NewMorseElement(origin);
    NewMorseElement.mySetWedgeProduct(NewWedgeProduct);
    NewMorseElement.myDivideRightProductWith(maximum);

    for (PathMap::const_iterator PathIter = paths.begin(); PathIter != paths.end(); ++PathIter)
    {
      myResolution[NewMorseElement].myAddPath(PathIter->first, PathIter->second * origin.myEpsilon(maximum, maximum) * origin.myEpsilon(LongIter, maximum) * indet(myRing, LongIter));
    }
  }


  void MorseGraph::myRightMinimization(const PathMap& paths,  DynamicBitset NewWedgeProduct, const MorseElement& origin, long maximum, long LongIter, StandardRepresentationContainer& container)
  {

    if (LongIter != maximum && (!origin.IamMultiplicativeIndex(LongIter)))
    {
      const bool InPolyRing(myMapRing == myRing);
      RingElem NewBasis(myCreateNewBasisElement(origin, LongIter, maximum));
      std::vector<RingElem> NormalForm(container.myComputeStandardRepresentation(NewBasis));
      std::vector<std::pair<RingElem, DynamicBitset> >::iterator BasisIter(myBasis.begin());
      for (std::vector<RingElem>::iterator NormalFormIter = NormalForm.begin(); NormalFormIter != NormalForm.end(); ++NormalFormIter)
      {
        for (SparsePolyIter SPI = myRing->myBeginIter(raw(*NormalFormIter)); SPI != myRing->myEndIter(raw(*NormalFormIter)); ++SPI)
        {
          MorseElement NewMorseElement(NewWedgeProduct, PP(SPI), BasisIter);
          for (PathMap::const_iterator PathIter = paths.begin(); PathIter != paths.end(); ++PathIter)
          {
            RingElem path(PathIter->second);
            if (InPolyRing)
            {
              SparsePolyRingPtr(myMapRing)->myMulByCoeff(raw(path), raw(coeff(SPI)));
            } else {
              myMapRing->myMul(raw(path), raw(path), raw(coeff(SPI)));
            }
            if (origin.myEpsilon(maximum, maximum) * origin.myEpsilon(LongIter, maximum) == 1)
            {
              myMapRing->myNegate(raw(path), raw(path));
            }
            myResolution[NewMorseElement].myAddPath(PathIter->first, path);
          }
        }
        ++BasisIter;
      }
    }
  }


  void MorseGraph::myComputeResolution()
  {
    myResolution.clear();
    StandardRepresentationContainer container(myMill);
    myComputeBasicGraph(myComputeGeneralBasis(), container);
    myDirectMorseReduction(container);
  }


  matrix MorseGraph::myComputeBettiNumbers()
  {
    myComputeConstantResolution();
    std::vector< std::vector<long> > ranks(myComputeRanks());
    std::vector< std::vector<long> > WasteRanks(myComputeWasteRanks(ranks));
    ranks = myMatrixMinus(ranks, WasteRanks);
    return myTransformRanksToBettis(ranks);
  }


  std::pair<matrix, matrix> MorseGraph::myComputePseudoBettiNumbers()
  {
    myComputeConstantResolution();
    std::vector< std::vector<long> > ranks(myComputeRanks());
    std::vector< std::vector<long> > WasteRanks(myComputeWasteRanks(ranks));
    return make_pair(myTransformRanksToBettis(ranks), myTransformRanksToBettis(myMatrixMinus(ranks,WasteRanks)));
  }


  std::vector< std::vector<long> > MorseGraph::myComputeWasteRanks(const std::vector< std::vector<long> >& ranks) const
  {
    std::map<MorseElement, MorsePaths>::const_iterator iter(myResolution.end());
    --iter;
    const long size((iter->first).myCountWedgeBasis());
    std::vector< std::vector<long> > WasteRanks (len(ranks), std::vector<long>(len(ranks[0]), 0));
    std::map<MorseElement, MorsePaths>::const_iterator ResIter(myResolution.begin());
    for (long i = 0; i < size; ++i)
    {
      myComputeWasteRanksPerMap(WasteRanks, ResIter, ranks, i);
    }
    return WasteRanks;
  }


  void MorseGraph::myComputeWasteRanksPerMap(std::vector< std::vector<long> >& WasteRanks, std::map<MorseElement, MorsePaths>::const_iterator& ResIter, const std::vector< std::vector<long> >& ranks, long PosInRes) const
  {
    std::vector<std::pair<long, long> > RanksOfDegreeMatrices(myComputeWasteRanksPerDegree(ResIter, ranks[PosInRes], ranks[PosInRes + 1], PosInRes));
    for (std::vector<std::pair<long, long> >::iterator RMIter = RanksOfDegreeMatrices.begin(); RMIter != RanksOfDegreeMatrices.end(); ++RMIter)
    {
      WasteRanks[PosInRes][RMIter->first] = WasteRanks[PosInRes][RMIter->first] + RMIter->second;
      long TooMuch(0);
      if (WasteRanks[PosInRes][RMIter->first] > ranks[PosInRes][RMIter->first])
      {
        TooMuch = WasteRanks[PosInRes][RMIter->first] - ranks[PosInRes][RMIter->first];
        WasteRanks[PosInRes][RMIter->first] = ranks[PosInRes][RMIter->first];
      }
      WasteRanks[PosInRes + 1][RMIter->first] = RMIter->second - TooMuch;
    }
  }


  std::vector<std::pair<long, long> > MorseGraph::myComputeWasteRanksPerDegree(std::map<MorseElement, MorsePaths>::const_iterator& ResIter, const std::vector<long>& RowRanks, const std::vector<long>& ColRanks, long PosInRes) const
  {
    std::vector<std::pair<long, long> > RanksOfDegreeMatrices;

    std::map<std::pair<long, MorseElement>, long> identifier(myGradedPositionMorseElements(PosInRes));
    for (long degree = 0; degree < len(RowRanks); ++degree)
    {
      if (RowRanks[degree] == 0 || ColRanks[degree] == 0)
      {
        if (RowRanks[degree] != 0)
        {
          while((ResIter->first).myDegree() == degree && (ResIter->first).myCountWedgeBasis() == PosInRes)
          {
            ++ResIter;
          }
        }
        continue;
      }
      matrix SubMat(ConstructDegreeMatrix(ResIter, RowRanks[degree], ColRanks[degree], degree, PosInRes, identifier));
      RanksOfDegreeMatrices.push_back(make_pair(degree, rank(SubMat)));
    }
    return RanksOfDegreeMatrices;
  }


