BrentBaccala/CoCoA/src/AlgebraicCore/TmpMorseGraph.C
  matrix MorseGraph::ConstructDegreeMatrix(std::map<MorseElement, MorsePaths>::const_iterator& ResIter, long rows, long cols, long degree, long PosInRes, const std::map<std::pair<long, MorseElement>, long>& identifier) const
  {
    matrix SubMat(NewDenseMat(myMapRing, rows, cols));
    while((ResIter->first).myDegree() == degree && (ResIter->first).myCountWedgeBasis() == PosInRes)
    {
      std::map<std::pair<long, MorseElement>, long>::const_iterator RowIter(identifier.find(make_pair(degree, ResIter->first)));
      if (RowIter != identifier.end())
      {
        const long PositionRow(RowIter->second);
        PathMap maps((ResIter->second).myGetPaths());
        for (PathMap::const_iterator MapIter = maps.begin(); MapIter != maps.end(); ++ MapIter)
        {
          std::map<std::pair<long, MorseElement>, long>::const_iterator ColIter(identifier.find(make_pair(degree, (MapIter->first)->first)));
          if (ColIter != identifier.end())
          {
            const long PositionCol(ColIter->second);
            SetEntry(SubMat, PositionRow, PositionCol, MapIter->second);
          }
        }
      }
      ++ResIter;
    }
    return SubMat;      
  }


  std::vector< std::vector<long> > MorseGraph::myComputeRanks() const
  {
    const long LengthRows = ((myResolution.rbegin())->first).myCountWedgeBasis() + 1;
    long LengthCols(0);
    std::vector< std::pair<long, long> > RanksVector;
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      RanksVector.push_back(make_pair((it->first).myCountWedgeBasis(), (it->first).myDegree()));
      if ((it->first).myDegree() > LengthCols)
      {
        LengthCols = (it->first).myDegree();
      }
    }
    std::vector< std::vector<long> > ranks (LengthRows, std::vector<long>(LengthCols + 1, 0));
    for (std::vector<std::pair<long, long> >::iterator it = RanksVector.begin(); it != RanksVector.end(); ++it)
    {
      ++ranks[it->first][it->second];
    }
    return ranks;
  }


  matrix MorseGraph::myTransformRanksToBettis(const std::vector<std::vector<long> >& ranks) const
  {
    const long RowsBetti(myNumRowsBettiDiagram(ranks));
    const long LenRanks = len(ranks);
    if (LenRanks == 1 && len(ranks[0]) == 1)
    {
      return NewDenseMat(RingZZ(), 1, 1);
    }
    matrix bettis(NewDenseMat(RingZZ(), RowsBetti, LenRanks + 1));
    for (long i = 0; i < LenRanks; ++i)
    {
      for (long j = i + 1; j < RowsBetti + i + 1; ++j)
      {
        SetEntry(bettis, j - i - 1, i + 1, ranks[i][j]);
      }
    }
    SetEntry(bettis, 0, 0, 1);
    for (long i = 1; i < NumRows(bettis); ++i)
    {
      SetEntry(bettis, i, 0, 0);
    }
    return bettis;
  }


  long MorseGraph::myNumRowsBettiDiagram(const std::vector<std::vector<long> >& ranks) const
  {
    CoCoA_ASSERT(!ranks.empty());
    const long res(len(ranks[0]) - len(ranks)); //skipping 0 degree
    if (res <= 0)
    {
      return 1;
    }
    return res;
  }


  std::vector<matrix> MorseGraph::myMapsAsMatrices() const
  {
    std::vector<matrix> res;
    std::map<MorseElement, MorsePaths>::const_iterator iter(myResolution.end());
    --iter;
    long size((iter->first).myCountWedgeBasis());
    for (long i = 0; i < size; ++i)
    {
      res.push_back(myMapsAsMatrix(i));
    }
    return res;
  }


  matrix MorseGraph::myMapsAsMatrix(long pos) const
  {
    matrix res = myInitialMapsAsMatrix(pos);
    std::map<MorseElement, long> identifier(myPositionMorseElements(pos));
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      if ((it->first).myCountWedgeBasis() == pos)
      {
        const long PositionRow(identifier[it->first]);
        PathMap maps((it->second).myGetPaths());
        for (PathMap::iterator MapIter = maps.begin(); MapIter != maps.end(); ++ MapIter)
        {
          const long PositionCol(identifier[(MapIter->first)->first]);
          SetEntry(res, PositionRow, PositionCol, MapIter->second);
        }
      }
    }
    return res;
  }


  matrix MorseGraph::myInitialMapsAsMatrix(long pos) const
  {
    long row(0);
    long col(0);
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      const long NumWedgeBasis((it->first).myCountWedgeBasis());
      if (pos > NumWedgeBasis)
      {
        continue;
      }
      if (pos == NumWedgeBasis)
      {
        ++row;
      }
      if ((pos + 1) == NumWedgeBasis)
      {
        ++col;
      }
      if ((pos + 1) < NumWedgeBasis)
      {
        break;
      }
    }
    return NewDenseMat(myMapRing, row, col);
  }


  std::vector<matrix> MorseGraph::myInitialMapsAsMatrices() const
  {
    std::vector<matrix> res;
    long SizePrecedingWedge(0);
    long row(-1);
    long col(0);
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      if (SizePrecedingWedge != (it->first).myCountWedgeBasis())
      {
        SizePrecedingWedge = (it->first).myCountWedgeBasis();
        if (row > 0)
        {
          res.push_back(NewDenseMat(myMapRing, row, col));
        }
        row = col;
        col = 0;
      }
      ++col;
    }
    if (row > 0)
    {
      res.push_back(NewDenseMat(myMapRing, row, col));
    }
    return res;
  }


// we can now access an element via <NumberWedges, Position In NumberWedges>
  std::map<MorseElement, long> MorseGraph::myPositionMorseElements(long NumberWedges) const
  {
    std::map<MorseElement, long> res;
    long pos1(0);
    long pos2(0);
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      if ((it->first).myCountWedgeBasis() == NumberWedges)
      {
        res.insert(make_pair(it->first, pos1));
        ++pos1;
      }
      if ((it->first).myCountWedgeBasis() == NumberWedges + 1)
      {
        res.insert(make_pair(it->first, pos2));
        ++pos2;
      }
    }
    return res;
  }


// we can now access an element via <NumberWedges, Position In NumberWedges>
// orderd by degree
  std::map<std::pair<long, MorseElement>, long> MorseGraph::myGradedPositionMorseElements(long NumberWedges) const
  {
    std::map<std::pair<long, MorseElement>, long> res;
    long pos(0);
    long degree(0);
    long OldNumberWedges(0);
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      const long CurrentNumberWedges((it->first).myCountWedgeBasis());
      if (CurrentNumberWedges < NumberWedges)
      {
        continue;
      }
      if (degree != (it->first).myDegree() || CurrentNumberWedges != OldNumberWedges)
      {
        pos = 0;
        degree = (it->first).myDegree();
        if (CurrentNumberWedges > NumberWedges + 1)
        {
          break;
        }
        OldNumberWedges = CurrentNumberWedges;
      }
      res.insert(make_pair(make_pair(degree, it->first), pos));
      ++pos;
    }
    return res;
  }


  std::vector<std::vector<long> > MorseGraph::myMatrixMinus(std::vector<std::vector<long> > m1, const std::vector<std::vector<long> >& m2) const
  {
    const long nrows = len(m1);
    const long ncols = len(m1[0]);
    for (long i = 0; i < nrows; ++i)
    {
      for (long j = 0; j < ncols; ++j)
      {
        m1[i][j] -= m2[i][j];
      }
    }
    return m1;
  }


  std::vector<matrix> MorseGraph::myComputeMinimalResolution()
  {
    //initialization
    myResolution.clear();
    StandardRepresentationContainer container(myMill);
    //compute resolution
    myComputeBasicGraph(myComputeGeneralBasis(), container);
    myDirectMorseReduction(container);
    //minimalization
    std::vector<matrix> maps(1, myZerothMatrix());
    std::vector<matrix> OtherMaps(myMapsAsMatrices());
    maps.insert(maps.end(), OtherMaps.begin(), OtherMaps.end());
    ResolutionMinimization minim(myRing, maps);
    minim.myMinimization();
    return minim.myGetResolution();
  }


  matrix MorseGraph::myZerothMatrix() const
  {
    std::vector<RingElem> vec;
    for (std::map<MorseElement, MorsePaths>::const_iterator it = myResolution.begin(); it != myResolution.end(); ++it)
    {
      if (0 != (it->first).myCountWedgeBasis())
      {
        break;
      }
      vec.push_back((it->first).myGetBasisElement());
    }
    CoCoA_ASSERT(!vec.empty());
    return NewDenseMat(RowMat(vec));
  }


  std::vector<matrix> MorseGraph::myGetResolution() const
  {
    std::vector<matrix> res(1, myZerothMatrix());
    std::vector<matrix> OtherMaps(myMapsAsMatrices());
    res.insert(res.end(), OtherMaps.begin(), OtherMaps.end());
    return res;
  }


