BrentBaccala/CoCoA/src/AlgebraicCore/TmpMorseGraph.C
  std::vector<std::pair<RingElem, DynamicBitset> > MorseGraph::myTransform(const std::vector<std::pair<RingElem, std::vector<bool> > >& VecWithBool) const
  {
    std::vector<std::pair<RingElem, DynamicBitset> > res; 
    for (std::vector<std::pair<RingElem, std::vector<bool> > >::const_iterator it = VecWithBool.begin(); it != VecWithBool.end(); ++it)
    {
      res.push_back(make_pair(it->first, myVectorBoolToDynamicBitset(it->second)));
    }
    return res;
  }


  void MorseGraph::myComputeConstantResolution()
  {
    myResolution.clear();
    myMapRing = CoeffRing(myRing);
    StandardRepresentationContainer container(myMill);
    myComputeBasicConstantGraph(myComputeGeneralBasis(), container);
  
    myConstantDirectMorseReduction(container);
  }


  matrix JBBettiDiagram(JBMill mill)
  {
    if (!(IsStdDegRevLex(ordering(owner(LPP(*(JBReturnJB(mill).begin())))))))
    {
      CoCoA_ERROR(ERR::PPOrder, "It must be the degrevlex ordering!!!");
    }
    if (!JBIsPommaretBasis(mill) || !JBIsHomogenous(mill))
    {
      CoCoA_ERROR("The ideal isn't homogenous or pommaret", "JBBettiDiagram");
    }
    MorseGraph mg(mill);
    return mg.myComputeBettiNumbers();
  }

  /*
   * computes the minimal free Resolution
   */
  std::vector<matrix> JBMinimalResolution(JBMill mill)
  {
    if (!(IsStdDegRevLex(ordering(owner(LPP(JBReturnJB(mill).front()))))))
    {
      CoCoA_ERROR(ERR::PPOrder, "It must be the degrevlex ordering!!!");
    }
    if (!JBIsPommaretBasis(mill) || !JBIsHomogenous(mill))
    {
      CoCoA_ERROR("The ideal isn't homogenous or pommaret", "JBMinimalResolution");
    }
    MorseGraph mg(mill);
    return mg.myComputeMinimalResolution();

  }


  /*
   * computes a free Resolution
   */
  std::vector<matrix> JBResolution(JBMill mill)
  {
    if (!(IsStdDegRevLex(ordering(owner(LPP(*(JBReturnJB(mill).begin())))))))
    {
      CoCoA_ERROR(ERR::PPOrder, "It must be the degrevlex ordering!!!");
    }
    if (!JBIsPommaretBasis(mill))
    {
      CoCoA_ERROR("The ideal isn't pommaret", "JBResolution");
    }
    MorseGraph mg(mill);
    mg.myComputeResolution();
    std::vector<matrix> maps(1, mg.myZerothMatrix());
    std::vector<matrix> OtherMaps(mg.myMapsAsMatrices());
    maps.insert(maps.end(), OtherMaps.begin(), OtherMaps.end());
    return maps;
  }


} // end of namespace CoCoA
